import React, { Component } from 'react';
import './Info.css';
import $ from 'jquery';

export default class Info extends Component {

componentDidMount() {

    var head = $("header");
    var stick = "sticky";
    var bottom = $(".bottom");
    var disappear = "sticky-bottom";

    $(".info-frame").scroll(function() {
        $(".info-frame").scrollTop() > 300
            ? head.addClass(stick) + bottom.addClass(disappear)
            : head.removeClass(stick) + bottom.removeClass(disappear)
    })

    $(".scroll-indicator").click(function() {
    $(".info-frame").animate({
        scrollTop: $(".info-step").offset().top-200
    }, 1500);
});
}

  render() {

    return (
        <div className="info-frame">
        <main>
        <div className="info-wrapper-background">
	<header>ความก้าวหน้าของโครงการ</header>
        </div>
<div className="bottom">
  <div className="scroll-indicator"></div>
</div>
  <div className="content-wrapper-info">
  <section className="info-step">
  <h1>หน้าตัวอย่าง</h1>
  <p>กรมทางหลวงได้จัดทำแผนพัฒนาทางหลวง โดยกำหนดตามทิศทางของการพัฒนาระบบคมนาคมและขนส่งของแผนพัฒนาเศรษฐกิจและสังคมแห่งชาติ ซึ่งประกอบไปด้วยการพัฒนาทางหลวงและอำนวยความปลอดภัยในรูปแบบต่างๆ รวมถึงงานก่อสร้างทางแยกต่างระดับและได้พิจารณาจัดลำดับความสำคัญ
   ในการพัฒนาและแก้ไขปัญหาต่างๆ ในทุกภูมิภาคทั่วประเทศ ซึ่งทางแยกจุดตัดระหว่างทางหลวงหมายเลข 2 (ถนนมิตรภาพ) กับถนนเทศบาลหรือถนนช้างเผือก (แยกประโดก) ตั้งอยู่ในเขตอำเภอเมืองนครราชสีมา จังหวัดนครราชสีมา มีปัญหาการจราจรคับคั่ง และมีชุมชนหนาแน่น ในปัจจุบันได้จัดการจราจรด้วยไฟสัญญาจราจร ซึ่งไม่สามารถรองรับปริมาณการเดินทางได้อย่างเพียงพอ ส่งผลกระทบกระแสการจราจรบนเส้นทางหลักบนเส้นทางหลัก (บนถนนมิตรภาพ) และสายรอง (ถนนเทศบาลหรือถนนช้างเผือก) ทำให้เกิดความล่าช้าในการเดินทางและติดขัด กรมทางหลวงจึงได้ดำเนินการสำรวจและออกแบบรายละเอียดทางแยกต่างระดับจุดตัดทางหลวงหมายเลข 2 กับถนนเทศบาล (แยกประโดก) ตามแผนพัฒนาทางหลวงระยะ 10 ปี (2550 - 2559) กำหนดให้มีการปรับปรุงบริเวณทางแยกโครงการฯ เป็นทางแยกต่างระดับเพื่อบรรเทาปัญหาการจราจรดังกล่าว เมื่อปี พ.ศ.2557 โดยดำเนินการสำรวจและวิเคราะห์ทางวิศวกรรมอย่างละเอียดและคำนึงถึงการลดผลกระทบต่อชุมชน สภาพแวดล้อมในพื้นที่โครงการ รวมถึงการรับฟังความคิดเห็นของประชาชนทั้งในระดับจังหวัดและในพื้นที่เพื่อนำข้อคิดเห็นมาประกอบการออกแบบโครงการอย่างเหมาะสม จากการตรวจสอบพื้นที่โครงการ พบว่า มีแหล่งโบราณสถานในระยะ 2 กิโลเมตรจากถนนของโครงการ ทำให้โครงการเข้าข่ายต้องจัดทำรายงานการวิเคราะห์ผลกระทบสิ่งแวดล้อม (EIA) ตามประกาศกระทรวงทรัพยากรและสิ่งแวดล้อม เรื่อง กำหนดประเภทและขนาดโครงการหรือกิจการ ซึ่งต้องจัดทำรายงานการวิเคราะห์ผลกระทบสิ่งแวดล้อมฯ เพื่อให้เป็นไปตามมาตร 46 แห่งพระราชบัญญัติส่งเสริมและรักษาคุณภาพสิ่งแวดล้อมแห่งชาติ พ.ศ.2535 และเพื่อให้การพัฒนาโครงการเกิดผลกระทบต่อทรัพยากรธรรมชาติและประชาชนที่อาศัยอยู่ในบริเวณพื้นที่โครงการน้อยที่สุด
 </p>
  </section>
  </div>
</main>

        </div>
    );
  }
}
