import React, { Component } from 'react';
import './About.css';
import $ from 'jquery';
import area from './area.jpg';

export default class Header extends Component {

componentDidMount() {

    var head = $("header");
    var stick = "sticky";
    var bottom = $(".bottom");
    var disappear = "sticky-bottom";

    $(".about-frame").scroll(function() {
        $(".about-frame").scrollTop() > 300
            ? head.addClass(stick) + bottom.addClass(disappear)
            : head.removeClass(stick) + bottom.removeClass(disappear)
    });

    $(".scroll-indicator").click(function() {
    $(".about-frame").animate({
        scrollTop: $(".about-project").offset().top-200
    }, 1500);
});
}

  render() {
    return (
        <div className="about-frame">
         <main>
         <div className="about-wrapper-background">
 <header>เกี่ยวกับโครงการ</header>
         </div>

 <div className="bottom">
   <div className="scroll-indicator"></div>
 </div>
 <div className="content-wrapper-about">
  <section className="about-project">
  <h1>ความเป็นมาของโครงการ</h1>
   <p>กรมทางหลวงได้จัดทำแผนพัฒนาทางหลวง โดยกำหนดตามทิศทางของการพัฒนาระบบคมนาคมและขนส่งของแผนพัฒนาเศรษฐกิจและสังคมแห่งชาติ ซึ่งประกอบไปด้วยการพัฒนาทางหลวงและอำนวยความปลอดภัยในรูปแบบต่างๆ รวมถึงงานก่อสร้างทางแยกต่างระดับและได้พิจารณาจัดลำดับความสำคัญ
    ในการพัฒนาและแก้ไขปัญหาต่างๆ ในทุกภูมิภาคทั่วประเทศ ซึ่งทางแยกจุดตัดระหว่างทางหลวงหมายเลข 2 (ถนนมิตรภาพ) กับถนนเทศบาลหรือถนนช้างเผือก (แยกประโดก) ตั้งอยู่ในเขตอำเภอเมืองนครราชสีมา จังหวัดนครราชสีมา มีปัญหาการจราจรคับคั่ง และมีชุมชนหนาแน่น ในปัจจุบันได้จัดการจราจรด้วยไฟสัญญาจราจร ซึ่งไม่สามารถรองรับปริมาณการเดินทางได้อย่างเพียงพอ ส่งผลกระทบกระแสการจราจรบนเส้นทางหลักบนเส้นทางหลัก (บนถนนมิตรภาพ) และสายรอง (ถนนเทศบาลหรือถนนช้างเผือก) ทำให้เกิดความล่าช้าในการเดินทางและติดขัด กรมทางหลวงจึงได้ดำเนินการสำรวจและออกแบบรายละเอียดทางแยกต่างระดับจุดตัดทางหลวงหมายเลข 2 กับถนนเทศบาล (แยกประโดก) ตามแผนพัฒนาทางหลวงระยะ 10 ปี (2550 - 2559) กำหนดให้มีการปรับปรุงบริเวณทางแยกโครงการฯ เป็นทางแยกต่างระดับเพื่อบรรเทาปัญหาการจราจรดังกล่าว เมื่อปี พ.ศ.2557 โดยดำเนินการสำรวจและวิเคราะห์ทางวิศวกรรมอย่างละเอียดและคำนึงถึงการลดผลกระทบต่อชุมชน สภาพแวดล้อมในพื้นที่โครงการ รวมถึงการรับฟังความคิดเห็นของประชาชนทั้งในระดับจังหวัดและในพื้นที่เพื่อนำข้อคิดเห็นมาประกอบการออกแบบโครงการอย่างเหมาะสม จากการตรวจสอบพื้นที่โครงการ พบว่า มีแหล่งโบราณสถานในระยะ 2 กิโลเมตรจากถนนของโครงการ ทำให้โครงการเข้าข่ายต้องจัดทำรายงานการวิเคราะห์ผลกระทบสิ่งแวดล้อม (EIA) ตามประกาศกระทรวงทรัพยากรและสิ่งแวดล้อม เรื่อง กำหนดประเภทและขนาดโครงการหรือกิจการ ซึ่งต้องจัดทำรายงานการวิเคราะห์ผลกระทบสิ่งแวดล้อมฯ เพื่อให้เป็นไปตามมาตร 46 แห่งพระราชบัญญัติส่งเสริมและรักษาคุณภาพสิ่งแวดล้อมแห่งชาติ พ.ศ.2535 และเพื่อให้การพัฒนาโครงการเกิดผลกระทบต่อทรัพยากรธรรมชาติและประชาชนที่อาศัยอยู่ในบริเวณพื้นที่โครงการน้อยที่สุด
  </p>
  <p>กรมทางหลวง จึงว่าจ้างกลุ่มบริษัทที่ปรึกษา อันประกอบด้วย บริษัท เทสโก้ จำกัด และบริษัท ธารา ไลน์ จำกัด ดำเนินการศึกษาผลกระทบสิ่งแวดล้อม ทางแยกต่างระดับจุดตัดทางหลวงหมายเลข 2
    (ถนนมิตรภาพ) กับถนนเทศบาลหรือถนนช้างเผือก (แยกประโดก) จังหวัดนครราชสีมา ระยะเวลาดำเนินการ 12 เดือน โดยเริ่มปฏิบัติงานตั้งแต่วันที่ 27 ตุลาคม 2560
    </p>
  </section>
  <section className="about-objective">
   <h1>วัตถุประสงค์</h1>
   <p>1. เพื่อศึกษารูปแบบการพัฒนาโครงการ และแผนการดำเนินโครงการ เพื่อเป็นข้อมูลพื้นฐานประกอบการประเมินผลกระทบสิ่งแวดล้อมของโครงการ</p>
   <p>2. เพื่อศึกษา รวบรวม และวิเคราะห์สภาพสิ่งแวดล้อมในปัจจุบัน และดำเนินการประเมินผลกระทบทางสังคมและสิ่งแวดล้อมที่จะเกิดขึ้นเนื่องมาจากการพัฒนาโครงการ พร้อมทั้งเสนอแนะมาตรการลดผลกระทบสิ่งแวดล้อม รวมทั้งแผนการจัดการด้านสิ่งแวดล้อมที่เหมาะสมและมีประสิทธิภาพ</p>
   <p>3. เพื่อส่งเสริม สนับสนุน และเปิดโอกาสให้ประชาชนเข้ามามีส่วนร่วมในการแสดงความคิดเห็นและข้อเสนอแนะที่เป็นประโยชน์ต่อการพัฒนาโครงการ รวมทั้งสร้างความสัมพันธ์อันดีกับชุมชน เจ้าหน้าที่ ภาครัฐ องค์กรเอกชน และทุกฝ่ายที่เกี่ยวข้องอย่างต่อเนื่อง</p>
   </section>
  <section className="about-area">
   <h1>พื้นที่ศึกษาและแนวเส้นทางโครงการ</h1>
   <p>พื้นที่ศึกษาของโครงการตั้งอยู่ที่ทางแยกจุดตัดระหว่างทางหลวงหมายเลข 2 (ถนนมิตรภาพ) กับถนนเทศบาลหรือถนนช้างเผือก (แยกประโดก) โดยในการศึกษาจะต้องดำเนินการให้ครอบคลุมพื้นที่โครงการและพื้นที่ใกล้เคียง ในรัศมีอย่างน้อย 500 เมตร จากศูนย์กลางถนนโครงการ และในการศึกษาผลกระทบด้านโบราณคดีจะต้องครอบคลุมรัศมีอย่างน้อย 2 กิโลเมตรจากศูนย์กลางถนนโครงการ</p>
   <img src={area}  className="area" alt="area" />
   </section>
   <section className="about-scope">

    </section>
</div>
 </main>

        </div>
    );
  }
}
